# AddWireMaterialType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..AddWireMaterialType Method
ElectricalSetting Class See Also
---
Add a new type of wire material.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireMaterialType AddWireMaterialType(
	string name,
	WireMaterialType baseMaterial
)
```

Visual Basic
---
```text
Public Function AddWireMaterialType ( _
	name As String, _
	baseMaterial As WireMaterialType _
) As WireMaterialType
```

Visual C++
---
```text
public:
WireMaterialType^ AddWireMaterialType(
	String^ name,
	WireMaterialType^ baseMaterial
)
```

# ### Parameters
name
    Type: System..::..StringName of new material type.
baseMaterial
    Type: Autodesk.Revit.DB.Electrical..::..WireMaterialTypeSpecify an existing material type which New material will be constructed based on.
# ### Return Value
New added wire material type object.
# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace